{
  "NeoHaskell": "NeoHaskell",
  "A modern approach to Haskell for building reliable software.": "Un enfoque moderno para Haskell para construir software confiable.",
  "Explore NeoHaskell": "Explora NeoHaskell",
  "Set up your environment and write your first NeoHaskell program.": "Configura tu entorno y escribe tu primer programa en NeoHaskell.",
  "Learn the fundamental ideas behind NeoHaskell.": "Aprende las ideas fundamentales detrás de NeoHaskell.",
  "Step-by-step tutorials for common tasks.": "Tutoriales paso a paso para tareas comunes.",
  "Detailed reference documentation for the NeoHaskell API.": "Documentación de referencia detallada para la API de NeoHaskell.",
  "Getting Started": "Comenzando",
  "Core Concepts": "Conceptos Principales",
  "Guides": "Guías",
  "API Reference": "Referencia de API",
  "Detailed reference documentation for the NeoHaskell API. This section provides c.735E98FE78AFB6BF58D7": "Documentación de referencia detallada para la API de NeoHaskell. Esta sección proporciona información completa sobre los módulos, funciones y tipos de NeoHaskell.",
  "Step-by-step tutorials for common NeoHaskell tasks.": "Tutoriales paso a paso para tareas comunes de NeoHaskell.",
  "Step-by-step tutorials for common NeoHaskell tasks. Browse our guides to learn h.59A138A627BF123D23F7": "Tutoriales paso a paso para tareas comunes de NeoHaskell. Explora nuestras guías para aprender cómo alcanzar objetivos específicos con NeoHaskell.",
  "More guides coming soon.": "Más guías próximamente.",
  "Get up and running with NeoHaskell.": "Ponte en marcha con NeoHaskell.",
  "Welcome to NeoHaskell! This section will guide you through setting up your devel.1BFB2C39C24935259484": "¡Bienvenido a NeoHaskell! Esta sección te guiará a través de la configuración de tu entorno de desarrollo, la instalación de NeoHaskell y la escritura de tu primer programa.",
  "Check back soon for detailed setup instructions.": "Vuelve pronto para obtener instrucciones detalladas de configuración.",
  "Fundamental ideas and principles behind NeoHaskell.": "Ideas y principios fundamentales detrás de NeoHaskell.",
  "Explore the fundamental ideas and principles behind NeoHaskell. This section cov.6E13D9A1E311BC9B17FA": "Explora las ideas y principios fundamentales detrás de NeoHaskell. Esta sección cubre los conceptos principales que hacen de NeoHaskell un enfoque moderno para construir software confiable.",
  "Check back soon for detailed explanations of NeoHaskell's type system, effects, .C4D666C771557CF9706C": "Vuelve pronto para obtener explicaciones detalladas sobre el sistema de tipos, efectos y más de NeoHaskell.",
  "Architecture Decision Records": "Registros de Decisiones Arquitectónicas",
  "Records of significant architectural decisions in NeoHaskell.": "Registros de decisiones arquitectónicas significativas en NeoHaskell.",
  "This section documents the key architectural choices made during the development.E66C636B06426C052BC1": "Esta sección documenta las principales elecciones arquitectónicas realizadas durante el desarrollo de NeoHaskell y la razón detrás de cada decisión.",
  "ADRs follow the format: context, decision, and consequences.": "Los ADRs siguen el formato: contexto, decisión y consecuencias."
}