{
  "NeoHaskell": "NeoHaskell",
  "A modern approach to Haskell for building reliable software.": "Une approche moderne du Haskell pour construire des logiciels fiables.",
  "Explore NeoHaskell": "Explorez NeoHaskell",
  "Set up your environment and write your first NeoHaskell program.": "Configurez votre environnement et écrivez votre premier programme NeoHaskell.",
  "Learn the fundamental ideas behind NeoHaskell.": "Découvrez les idées fondamentales derrière NeoHaskell.",
  "Step-by-step tutorials for common tasks.": "Des tutoriels étape par étape pour des tâches courantes.",
  "Detailed reference documentation for the NeoHaskell API.": "Documentation de référence détaillée pour l'API NeoHaskell.",
  "Getting Started": "Commencer",
  "Core Concepts": "Concepts de base",
  "Guides": "Guides",
  "API Reference": "Référence API",
  "Detailed reference documentation for the NeoHaskell API. This section provides c.735E98FE78AFB6BF58D7": "Documentation de référence détaillée pour l'API NeoHaskell. Cette section fournit des informations complètes sur les modules, les fonctions et les types de NeoHaskell.",
  "Step-by-step tutorials for common NeoHaskell tasks.": "Tutoriels pas à pas pour les tâches courantes de NeoHaskell.",
  "Step-by-step tutorials for common NeoHaskell tasks. Browse our guides to learn h.59A138A627BF123D23F7": "Tutoriels pas à pas pour les tâches courantes de NeoHaskell. Parcourez nos guides pour apprendre à atteindre des objectifs spécifiques avec NeoHaskell.",
  "More guides coming soon.": "Davantage de guides à venir prochainement.",
  "Get up and running with NeoHaskell.": "Mettez-vous en route avec NeoHaskell.",
  "Welcome to NeoHaskell! This section will guide you through setting up your devel.1BFB2C39C24935259484": "Bienvenue sur NeoHaskell ! Cette section vous guidera à travers la configuration de votre environnement de développement, l'installation de NeoHaskell et l'écriture de votre premier programme.",
  "Check back soon for detailed setup instructions.": "Revenez bientôt pour des instructions détaillées sur la configuration.",
  "Fundamental ideas and principles behind NeoHaskell.": "Idées et principes fondamentaux derrière NeoHaskell.",
  "Explore the fundamental ideas and principles behind NeoHaskell. This section cov.6E13D9A1E311BC9B17FA": "Découvrez les idées et principes fondamentaux derrière NeoHaskell. Cette section couvre les concepts de base qui font de NeoHaskell une approche moderne pour créer des logiciels fiables.",
  "Check back soon for detailed explanations of NeoHaskell's type system, effects, .C4D666C771557CF9706C": "Revenez bientôt pour des explications détaillées sur le système de types, les effets et bien plus de NeoHaskell.",
  "Architecture Decision Records": "Dossiers de Décisions Architecturales",
  "Records of significant architectural decisions in NeoHaskell.": "Dossiers des décisions architecturales significatives dans NeoHaskell.",
  "This section documents the key architectural choices made during the development.E66C636B06426C052BC1": "Cette section documente les choix architecturaux clés effectués pendant le développement de NeoHaskell et la logique derrière chaque décision.",
  "ADRs follow the format: context, decision, and consequences.": "Les ADR suivent le format : contexte, décision, et conséquences."
}