{
  "NeoHaskell": "NeoHaskell",
  "A modern approach to Haskell for building reliable software.": "信頼性の高いソフトウェアを構築するためのモダンなHaskellのアプローチ。",
  "Explore NeoHaskell": "NeoHaskellを探求する",
  "Set up your environment and write your first NeoHaskell program.": "環境を設定して、初めてのNeoHaskellプログラムを書いてみましょう。",
  "Learn the fundamental ideas behind NeoHaskell.": "NeoHaskellの基本的なアイデアを学びましょう。",
  "Step-by-step tutorials for common tasks.": "一般的なタスクのためのステップバイステップのチュートリアル。",
  "Detailed reference documentation for the NeoHaskell API.": "NeoHaskell APIの詳細なリファレンスドキュメント。",
  "Getting Started": "はじめに",
  "Core Concepts": "コアコンセプト",
  "Guides": "ガイド",
  "API Reference": "APIリファレンス",
  "Detailed reference documentation for the NeoHaskell API. This section provides c.735E98FE78AFB6BF58D7": "NeoHaskell APIの詳細なリファレンスドキュメント。このセクションでは、NeoHaskellのモジュール、関数、型について包括的な情報を提供します。",
  "Step-by-step tutorials for common NeoHaskell tasks.": "一般的なNeoHaskellのタスクに対する段階的なチュートリアル。",
  "Step-by-step tutorials for common NeoHaskell tasks. Browse our guides to learn h.59A138A627BF123D23F7": "一般的なNeoHaskellのタスクに対する段階的なチュートリアル。NeoHaskellを使用して特定の目標を達成する方法を学ぶために、弊社のガイドをご覧ください。",
  "More guides coming soon.": "さらに多くのガイドが近日公開予定です。",
  "Get up and running with NeoHaskell.": "NeoHaskell を使い始めましょう。",
  "Welcome to NeoHaskell! This section will guide you through setting up your devel.1BFB2C39C24935259484": "NeoHaskell へようこそ！このセクションでは、開発環境のセットアップ、NeoHaskell のインストール、そして最初のプログラムの作成方法についてご案内します。",
  "Check back soon for detailed setup instructions.": "詳しいセットアップの手順は、近日公開予定ですのでお待ちください。",
  "Fundamental ideas and principles behind NeoHaskell.": "NeoHaskellの基本的な考え方と原則。",
  "Explore the fundamental ideas and principles behind NeoHaskell. This section cov.6E13D9A1E311BC9B17FA": "NeoHaskellの基本的な考え方と原則を探求してください。このセクションでは、NeoHaskellを信頼性の高いソフトウェアを構築するためのモダンなアプローチとするコアコンセプトについて説明します。",
  "Check back soon for detailed explanations of NeoHaskell's type system, effects, .C4D666C771557CF9706C": "NeoHaskellの型システム、エフェクトなどについての詳細な説明を近日中にご確認ください。",
  "Architecture Decision Records": "アーキテクチャ決定記録",
  "Records of significant architectural decisions in NeoHaskell.": "NeoHaskellにおける重要なアーキテクチャ上の決定の記録。",
  "This section documents the key architectural choices made during the development.E66C636B06426C052BC1": "このセクションでは、NeoHaskellの開発中に行われた主要なアーキテクチャの選択と、その各決定の背後にある理由を記録します。",
  "ADRs follow the format: context, decision, and consequences.": "ADRは、コンテキスト、決定、そしてその結果という形式に従います。"
}