{
  "NeoHaskell": "NeoHaskell",
  "A modern approach to Haskell for building reliable software.": "Современный подход к Haskell для создания надежного программного обеспечения.",
  "Explore NeoHaskell": "Исследуйте NeoHaskell",
  "Set up your environment and write your first NeoHaskell program.": "Настройте свою среду и напишите свою первую программу на NeoHaskell.",
  "Learn the fundamental ideas behind NeoHaskell.": "Изучите основные идеи, лежащие в основе NeoHaskell.",
  "Step-by-step tutorials for common tasks.": "Пошаговые руководства для выполнения типичных задач.",
  "Detailed reference documentation for the NeoHaskell API.": "Подробная справочная документация по API NeoHaskell.",
  "Getting Started": "Начало работы",
  "Core Concepts": "Основные концепции",
  "Guides": "Руководства",
  "API Reference": "Справочник API",
  "Detailed reference documentation for the NeoHaskell API. This section provides c.735E98FE78AFB6BF58D7": "Подробная справочная документация по API NeoHaskell. Этот раздел предоставляет исчерпывающую информацию о модулях, функциях и типах NeoHaskell.",
  "Step-by-step tutorials for common NeoHaskell tasks.": "Пошаговые руководства по выполнению распространенных задач в NeoHaskell.",
  "Step-by-step tutorials for common NeoHaskell tasks. Browse our guides to learn h.59A138A627BF123D23F7": "Пошаговые руководства по выполнению распространенных задач в NeoHaskell. Просмотрите наши руководства, чтобы узнать, как достичь конкретных целей с NeoHaskell.",
  "More guides coming soon.": "Скоро появятся дополнительные руководства.",
  "Get up and running with NeoHaskell.": "Начните работу с NeoHaskell.",
  "Welcome to NeoHaskell! This section will guide you through setting up your devel.1BFB2C39C24935259484": "Добро пожаловать в NeoHaskell! Этот раздел поможет вам настроить вашу среду разработки, установить NeoHaskell и написать вашу первую программу.",
  "Check back soon for detailed setup instructions.": "Следите за обновлениями для получения подробных инструкций по настройке.",
  "Fundamental ideas and principles behind NeoHaskell.": "Фундаментальные идеи и принципы, лежащие в основе NeoHaskell.",
  "Explore the fundamental ideas and principles behind NeoHaskell. This section cov.6E13D9A1E311BC9B17FA": "Изучите фундаментальные идеи и принципы, лежащие в основе NeoHaskell. Этот раздел охватывает основные концепции, которые делают NeoHaskell современным подходом к созданию надежного программного обеспечения.",
  "Check back soon for detailed explanations of NeoHaskell's type system, effects, .C4D666C771557CF9706C": "Пожалуйста, загляните сюда позже для получения детальных объяснений о типовой системе NeoHaskell, эффектах и многом другом.",
  "Architecture Decision Records": "Записи о принятых архитектурных решениях",
  "Records of significant architectural decisions in NeoHaskell.": "Записи о значительных архитектурных решениях в NeoHaskell.",
  "This section documents the key architectural choices made during the development.E66C636B06426C052BC1": "Этот раздел документирует ключевые архитектурные выборы, сделанные во время разработки NeoHaskell, и обоснование каждого решения.",
  "ADRs follow the format: context, decision, and consequences.": "ADRs следуют формату: контекст, решение и последствия."
}